*** Phone and tablet specifications
|-------------------+--------+-------+---------+------------+---------+----------+------------+------------+-----------|
| phone             | height | width | width/4 |    width/6 | width/8 | width/10 |   width/12 |  height/13 |      diag |
|-------------------+--------+-------+---------+------------+---------+----------+------------+------------+-----------|
| pixel 8 pro       |   6.40 |  3.00 |    0.75 |        0.5 |   0.375 |      0.3 |       0.25 | 0.49230769 | 7.0682388 |
| pixel 8           |   5.90 |  2.80 |     0.7 | 0.46666667 |    0.35 |     0.28 | 0.23333333 | 0.45384615 | 6.5306967 |
| pixel 7a          |   6.00 |  2.80 |     0.7 | 0.46666667 |    0.35 |     0.28 | 0.23333333 | 0.46153846 | 6.6211781 |
| iphone 15 pro max |   6.29 |  3.02 |   0.755 | 0.50333333 |  0.3775 |    0.302 | 0.25166667 | 0.48384615 | 6.9774279 |
| iphone 15 pro     |   5.77 |  2.78 |   0.695 | 0.46333333 |  0.3475 |    0.278 | 0.23166667 | 0.44384615 | 6.4047873 |
| iphone 15         |   5.80 |  2.82 |   0.705 |       0.47 |  0.3525 |    0.282 |      0.235 | 0.44615385 | 6.4492170 |
| S24 Ultra         |   6.39 |  3.11 |  0.7775 | 0.51833333 | 0.38875 |    0.311 | 0.25916667 | 0.49153846 | 7.1066307 |
| OnePlus 12        |   6.50 |  3.00 |    0.75 |        0.5 |   0.375 |      0.3 |       0.25 |        0.5 | 7.1589105 |
| OnePlus 12R       |   6.43 |  2.96 |    0.74 | 0.49333333 |    0.37 |    0.296 | 0.24666667 | 0.49461538 | 7.0785945 |
| ipad pro 12.9     |  11.04 |  8.46 |   2.115 |       1.41 |  1.0575 |    0.846 |      0.705 | 0.84923077 | 13.908745 |
| ipad pro 11       |   9.74 |  7.02 |   1.755 |       1.17 |  0.8775 |    0.702 |      0.585 | 0.74923077 | 12.006165 |
| ipad air          |   9.74 |  7.02 |   1.755 |       1.17 |  0.8775 |    0.702 |      0.585 | 0.74923077 | 12.006165 |
| ipad              |   9.79 |  7.07 |  1.7675 |  1.1783333 | 0.88375 |    0.707 | 0.58916667 | 0.75307692 | 12.075968 |
| ipad mini         |   7.69 |  5.30 |   1.325 | 0.88333333 |  0.6625 |     0.53 | 0.44166667 | 0.59153846 | 9.3394914 |
| 8 inch 16x9       |   6.97 |  3.92 |    0.98 | 0.65333333 |    0.49 |    0.392 | 0.32666667 | 0.53615385 | 7.9967056 |
| 10 inch 16x9      |   8.72 |   4.9 |   1.225 | 0.81666667 |  0.6125 |     0.49 | 0.40833333 | 0.67076923 | 10.002420 |
#+TBLFM: $4=$3/4::$5=$3/6::$6=$3/8::$7=$3/10::$8=$3/12::$9=$2/13::$10=sqrt($2*$2+$3*$3)
*** and 7/8 scale length is the distance from nute to third octave fret, but no
    guitar has a third octave fret.
| fret | 24 fret |
| 0.35 |     8.4 |
| 0.40 |     9.6 |
| 0.45 |    10.8 |
| 0.50 |     12. |
#+TBLFM: $2=$1*24
